tutorials/secondOrderIBMStudy/secondOrderIBMGrid1000/system/controlVolumeSampling
/*--------------------------------*- C++ -*----------------------------------*\
|  ========= |                                                                |
| \\       /   F ield        | OpenFOAM: The Open Source CFD Toolbox          |
|  \\     /    O peration    | Version: 2.2.0                                 |
|   \\   /     A nd          | Web: www.OpenFOAM.org                          |
|    \\ /      M anipulation |                                                |
\*---------------------------------------------------------------------------*/
FoamFile                                                                       
{                                                                              
version 2.0;                                                                   
format ascii;                                                                  
class dictionary;                                                              
object surface_sampling;                                                            
}                                                                              
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "controlVolumeSamplingVariables";

type                sets;
libs                ("libsampling.so");

fields              
(
    U
    p
    grad(U)
);

setFormat       raw;
interpolationScheme cellPointFace;

writeControl        writeTime;

sets
(
    frontLine
    {
        type        uniform;
        axis        y;
        start       ($x_min $y_lowerCorner $center_z);
        end         ($x_min $y_upperCorner $center_z);
        nPoints     $nPointsY;
    }
    backLine
    {
        type        uniform;
        axis        y;
        start       ($x_max $y_lowerCorner $center_z);
        end         ($x_max $y_upperCorner $center_z);
        nPoints     $nPointsY;
    }
    upperLine
    {
        type        uniform;
        axis        x;
        start       ($x_lowerCorner $y_max $center_z);
        end         ($x_upperCorner $y_max $center_z);
        nPoints     $nPointsX;
    }
    lowerLine
    {
        type        uniform;
        axis        x;
        start       ($x_lowerCorner $y_min $center_z);
        end         ($x_upperCorner $y_min $center_z);
        nPoints     $nPointsX;
    }
);
